In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from sklearn import model_selection
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
import matplotlib.pyplot as plt
import seaborn as sb
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
%matplotlib inline

In [5]:
from sklearn.model_selection import train_test_split

In [37]:
full_data = pd.read_csv('../data/final_data/full_data_postulaciones.csv')

In [38]:
full_data.head()

,idpostulante,valor_educacion,sexo,edad,idaviso,fechapostulacion,tipo_de_trabajo,nivel_laboral,denominacion_empresa
0,NdJl,15,1,51.0,1112260409,2018-01-24 05:17:29,1,4,NEW TALENT
1,66XQMv,15,1,38.0,1112260409,2018-01-18 14:34:47,1,4,NEW TALENT
2,ZlXp1Y,15,1,39.0,1112260409,2018-01-17 08:02:27,1,4,NEW TALENT
3,6oYpOv,15,0,48.0,1112260409,2018-01-16 15:22:42,1,4,NEW TALENT
4,ewQq5r,15,0,48.0,1112260409,2018-01-22 02:34:02,1,4,NEW TALENT

In [39]:
full_data.drop('denominacion_empresa', axis=1, inplace=True)

In [40]:
full_data.head()

,idpostulante,valor_educacion,sexo,edad,idaviso,fechapostulacion,tipo_de_trabajo,nivel_laboral
0,NdJl,15,1,51.0,1112260409,2018-01-24 05:17:29,1,4
1,66XQMv,15,1,38.0,1112260409,2018-01-18 14:34:47,1,4
2,ZlXp1Y,15,1,39.0,1112260409,2018-01-17 08:02:27,1,4
3,6oYpOv,15,0,48.0,1112260409,2018-01-16 15:22:42,1,4
4,ewQq5r,15,0,48.0,1112260409,2018-01-22 02:34:02,1,4

In [41]:
full_data['se_postulo'] = 1
full_data.head()

,idpostulante,valor_educacion,sexo,edad,idaviso,fechapostulacion,tipo_de_trabajo,nivel_laboral,se_postulo
0,NdJl,15,1,51.0,1112260409,2018-01-24 05:17:29,1,4,1
1,66XQMv,15,1,38.0,1112260409,2018-01-18 14:34:47,1,4,1
2,ZlXp1Y,15,1,39.0,1112260409,2018-01-17 08:02:27,1,4,1
3,6oYpOv,15,0,48.0,1112260409,2018-01-16 15:22:42,1,4,1
4,ewQq5r,15,0,48.0,1112260409,2018-01-22 02:34:02,1,4,1

In [43]:
full_data.drop(['fechapostulacion', 'idaviso'],axis=1,inplace=True)

In [44]:
y = np.array(full_data['se_postulo'])

In [45]:
#cat_columns = full_data.select_dtypes(['idpostulante']).columns
#full_data[cat_columns] = full_data[cat_columns].apply(lambda x: x.cat.codes)
# Convierto el nombre del area a category.
full_data['idpostulante'] = full_data['idpostulante'].astype('category')

In [46]:
#cat_columns = full_data.select_dtypes(['idpostulante']).columns
lb_make = LabelEncoder()
full_data["idpostulante2"] = lb_make.fit_transform(full_data["idpostulante"])
full_data[["idpostulante", "idpostulante2"]].head()
#full_data[cat_columns] = full_data[cat_columns].apply(lambda x: x.cat.codes)

  idpostulante  idpostulante2
0         NdJl         116209
1       66XQMv          38071
2       ZlXp1Y         166635
3       6oYpOv          41817
4       ewQq5r         198682

In [28]:
X = np.array(full_data.drop(['fechapostulacion','idaviso','idpostulante'],1))
X.shape

(4855432, 7)

In [51]:
full_data.drop('idpostulante', axis=1, inplace=True)

In [52]:
full_data_m = full_data.as_matrix()
full_data_m = np.matrix(full_data_m)

In [53]:
# CREA dataset TRAIN y TEST
#---------------------------------------------------------------------------------------------
np.random.seed(123)
m_train    = np.random.rand(len(full_data_m)) < 0.5
data_train = full_data_m[m_train,]
data_test  = full_data_m[~m_train,]

In [54]:
# CLASE
#---------------------------------------------------------------------------------------------
clase_train = data_train[:,-1]
clase_train = clase_train.A1 #convierte de matriz a vector 
clase_test  = data_test[:,-1]
clase_test  = clase_test.A1 #convierte de matriz a vector

In [ ]:
# MODELO
#---------------------------------------------------------------------------------------------
modelo_lr = LogisticRegression()
modelo_lr.fit(X=data_train[:,:-1],y=clase_train)

In [ ]:

# PREDICCION
#---------------------------------------------------------------------------------------------
predicion = modelo_lr.predict(data_test[:,:-1])


# METRICAS
#---------------------------------------------------------------------------------------------
print(metrics.classification_report(y_true=clase_test, y_pred=predicion))
print(pd.crosstab(data_test[:,-1].A1, predicion, rownames=['REAL'], colnames=['PREDICCION']))

In [2]:
df = pd.read_csv('../data/final_data/entrenamiento_postulaciones_vistas4.csv', encoding='utf-8')
df.head()

,idaviso,idpostulante,timestamp,valor_educacion,sexo,idtitulo,idzona,idciudad,idmapacalle,idtipo_de_trabajo,idnivel_laboral,idnombre_area,iddenominacion_empresa,se_postulo
0,1111556097,365446,7.038007e+06,17,1,0,0,0,0,0,0,0,0,1
1,1112370711,365446,7.476885e+06,17,1,6996,0,0,0,0,0,45,14,1
2,1112326655,365446,9.809277e+06,17,1,11827,0,0,0,0,0,4,33,1
3,1112350182,365446,8.856385e+06,17,1,2141,0,0,0,0,0,31,38,1
4,1112383837,365446,7.563903e+06,17,1,6942,0,0,0,0,0,75,46,1

In [3]:
# X will have the numeric data, Y will have the target class
dfix = df.ix[:, 0:13];
X = np.array(dfix)
y = np.array(df['se_postulo'])

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [6]:
# Split into train and test, use only 10% as test (15 flowers)
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=7506)
X_test

array([[  1.11241876e+09,   2.56340000e+04,   4.17343225e+06, ...,
          0.00000000e+00,   7.60000000e+01,   1.00000000e+01],
       [  1.11234254e+09,   1.24354000e+05,   8.95024431e+06, ...,
          0.00000000e+00,   1.30000000e+01,   1.79200000e+03],
       [  1.11227764e+09,   2.26590000e+05,   1.04896253e+07, ...,
          2.00000000e+00,   4.70000000e+01,   4.38000000e+02],
       ...,
       [  1.11239744e+09,   1.78446000e+05,   4.74903463e+06, ...,
          1.00000000e+00,   5.30000000e+01,   3.65500000e+03],
       [  1.11166223e+09,   2.86619000e+05,   1.12488263e+07, ...,
          1.00000000e+00,   1.90000000e+01,   1.13000000e+03],
       [  1.11235984e+09,   1.52316000e+05,   8.57449731e+06, ...,
          0.00000000e+00,   1.12000000e+02,   5.77000000e+02]])

In [7]:
modelo_lr = LogisticRegression()

In [8]:
modelo_lr.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [9]:
pred = modelo_lr.predict(X_test)

In [10]:
print (accuracy_score(y_test, pred))

0.800666154562

In [11]:
X_full_data = np.array(dfix)
X_full_data

array([[  1.11155610e+09,   3.65446000e+05,   7.03800731e+06, ...,
          0.00000000e+00,   0.00000000e+00,   0.00000000e+00],
       [  1.11237071e+09,   3.65446000e+05,   7.47688531e+06, ...,
          0.00000000e+00,   4.50000000e+01,   1.40000000e+01],
       [  1.11232666e+09,   3.65446000e+05,   9.80927731e+06, ...,
          0.00000000e+00,   4.00000000e+00,   3.30000000e+01],
       ...,
       [  1.11160188e+09,   3.23892000e+05,   8.13147410e+06, ...,
          0.00000000e+00,   6.00000000e+00,   7.10000000e+01],
       [  1.11131998e+09,   3.99727000e+05,   8.12986248e+06, ...,
          0.00000000e+00,   3.00000000e+00,   3.29000000e+02],
       [  1.11208492e+09,   1.20330000e+05,   8.12629305e+06, ...,
          0.00000000e+00,   1.40000000e+01,   1.85000000e+03]])

In [13]:
pred_full_data = modelo_lr.predict(X_full_data)

In [14]:
df['sepostulo'] = pred_full_data

# Subida

In [15]:
top100 = pd.read_csv("../test_final_100k.csv", encoding='utf-8')

In [16]:
id_postulantes = pd.read_csv('../data/final_data/entrenamiento_id_postulantes.csv', encoding='utf-8')
id_postulantes.drop('Unnamed: 0', axis=1, inplace=True)
id_postulantes.shape
id_postulantes.head()

  idpostulante  idpostulante2
0      pzeVW63         365446
1      PmVbBWY         209736
2      zvPMxvJ         409297
3       YYwJKq         250105
4      3NkMAVq          37024

In [17]:
top100_full = pd.merge(top100, id_postulantes, how='left', on='idpostulante')
top100_full.shape

(100000, 4)

In [18]:
top100_full.drop('idpostulante', inplace=True, axis=1)
top100_full.rename({'idpostulante2':'idpostulante'}, inplace=True, axis=1)
top100_full.head()

   id  idaviso  idpostulante
0   0   739260       63651.0
1   1   739260       76877.0
2   2   739260      323397.0
3   3   758580           NaN
4   4   758580      127342.0

In [19]:
top100_full = pd.merge(top100_full, df, how='left', on=['idaviso','idpostulante'])
top100_full.shape

(100000, 16)

In [20]:
top100_full = top100_full[['id', 'se_postulo', 'sepostulo']]
top100_full.head()

   id  se_postulo  sepostulo
0   0         NaN        NaN
1   1         NaN        NaN
2   2         NaN        NaN
3   3         NaN        NaN
4   4         NaN        NaN

In [21]:
top100_full.fillna(0, inplace=True)

In [22]:
top100_full['se_postulo'] = top100_full['se_postulo'].astype('int')
top100_full['sepostulo'] = top100_full['sepostulo'].astype('int')
top100_full.head()

   id  se_postulo  sepostulo
0   0           0          0
1   1           0          0
2   2           0          0
3   3           0          0
4   4           0          0

In [23]:
top100_full.loc[(top100_full['sepostulo'] == 0) & (top100_full['se_postulo'] == 1), 'sepostulo'] = 1
top100_full[(top100_full['sepostulo'] == 0) & (top100_full['se_postulo'] == 1)]['sepostulo']

Series([], Name: sepostulo, dtype: int64)

In [24]:
top100_full.drop('se_postulo', axis=1, inplace=True)

In [25]:
top100_full[top100_full['sepostulo'] == 1].shape

(33553, 2)

In [26]:
# top100_full.rename({'se_postulo' : 'sepostulo'}, inplace=True, axis=1)
top100_full.to_csv('../data/entrega/top100k_logreg100l2.csv', encoding='utf-8', index=False)